{"format": "graph-model", "generatedBy": "2.8.2", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"args_0": {"name": "args_0:0", "dtype": "DT_STRING", "tensorShape": {"dim": [{"size": "-1"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_STRING", "tensorShape": {"dim": [{"size": "1"}]}}, "output_2": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}]}}}}, "modelTopology": {"node": [{"name": "unknown_9", "op": "Const", "attr": {"dtype": {"type": "DT_STRING"}, "value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/embedding_4/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}}, {"name": "args_0", "op": "Placeholder", "attr": {"dtype": {"type": "DT_STRING"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "unknown", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "unknown_8", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15", "op": "NoOp", "input": ["^args_0", "^unknown", "^unknown_8"]}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/dense_4/Tensordot/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/dense_4/Tensordot/axes", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/dense_4/Tensordot/GatherV2_1/axis", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/dense_4/Tensordot/Const_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/dense_4/Tensordot/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "145"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/input/_34", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "384"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/unstack-folded-0", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/strided_slice/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/strided_slice/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/strided_slice/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/zeros/packed/1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/zeros/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/input/_35", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "384"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/unstack-folded-1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/time", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/ExpandDims_1/dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/transpose/perm", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/strided_slice/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/strided_slice/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/strided_slice/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/loop_counter", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/transpose_1/perm", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/dense_4/Tensordot/free", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/dense_4/Tensordot/GatherV2/axis", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/dense_4/Tensordot/Const_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/dense_4/Tensordot/concat_1/axis", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/dense_4/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "145"}]}}}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/strided_slice/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/strided_slice/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/strided_slice/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input/_25", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "145"}]}}}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/categorical/Multinomial/num_samples", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input/_19", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "145"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input/_18", "op": "Const", "input": ["^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/enter/_50", "op": "Enter", "input": ["Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/input/_34"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvb25lX3N0ZXBfMy9TdGF0ZWZ1bFBhcnRpdGlvbmVkQ2FsbC9teV9tb2RlbF80L2dydV80L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/enter/_51", "op": "Enter", "input": ["ConstantFolding/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/unstack-folded-0"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvb25lX3N0ZXBfMy9TdGF0ZWZ1bFBhcnRpdGlvbmVkQ2FsbC9teV9tb2RlbF80L2dydV80L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/enter/_52", "op": "Enter", "input": ["Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/input/_35"], "attr": {"T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvb25lX3N0ZXBfMy9TdGF0ZWZ1bFBhcnRpdGlvbmVkQ2FsbC9teV9tb2RlbF80L2dydV80L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/enter/_53", "op": "Enter", "input": ["ConstantFolding/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/unstack-folded-1"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvb25lX3N0ZXBfMy9TdGF0ZWZ1bFBhcnRpdGlvbmVkQ2FsbC9teV9tb2RlbF80L2dydV80L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/enter/_45", "op": "Enter", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/time"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvb25lX3N0ZXBfMy9TdGF0ZWZ1bFBhcnRpdGlvbmVkQ2FsbC9teV9tb2RlbF80L2dydV80L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/enter/_43", "op": "Enter", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/loop_counter"], "attr": {"T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvb25lX3N0ZXBfMy9TdGF0ZWZ1bFBhcnRpdGlvbmVkQ2FsbC9teV9tb2RlbF80L2dydV80L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/string_lookup/None_Lookup/LookupTableFindV2", "op": "LookupTableFindV2", "input": ["unknown", "args_0", "Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input/_18"], "attr": {"Tin": {"type": "DT_STRING"}, "Tout": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/merge/_61", "op": "Merge", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/enter/_50", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/next_iteration/_97"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/merge/_62", "op": "Merge", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/enter/_51", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/next_iteration/_98"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/merge/_63", "op": "Merge", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/enter/_52", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/next_iteration/_99"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/merge/_64", "op": "Merge", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/enter/_53", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/next_iteration/_100"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/merge/_56", "op": "Merge", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/enter/_45", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/next_iteration/_92"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/merge/_54", "op": "Merge", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/enter/_43", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/next_iteration/_90"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/embedding_4/embedding_lookup", "op": "GatherV2", "input": ["Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input/_19", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/string_lookup/None_Lookup/LookupTableFindV2", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/embedding_4/embedding_lookup/axis"], "attr": {"Taxis": {"type": "DT_INT64"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT64"}, "Tparams": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/embedding_4/embedding_lookup"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/ExpandDims_1", "op": "ExpandDims", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/embedding_4/embedding_lookup", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/ExpandDims_1/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/Shape", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/strided_slice/stack", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/strided_slice/stack_1", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/ExpandDims_1", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/strided_slice", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/zeros/packed/1"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/transpose", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/transpose"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/zeros/packed", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/zeros/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/enter/_49", "op": "Enter", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"T": {"type": "DT_VARIANT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvb25lX3N0ZXBfMy9TdGF0ZWZ1bFBhcnRpdGlvbmVkQ2FsbC9teV9tb2RlbF80L2dydV80L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/Shape", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/enter/_47", "op": "Enter", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/zeros", "^Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/input_control_node/_15"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvb25lX3N0ZXBfMy9TdGF0ZWZ1bFBhcnRpdGlvbmVkQ2FsbC9teV9tb2RlbF80L2dydV80L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/merge/_60", "op": "Merge", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/enter/_49", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/next_iteration/_96"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/strided_slice"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/enter/_48", "op": "Enter", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/strided_slice"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvb25lX3N0ZXBfMy9TdGF0ZWZ1bFBhcnRpdGlvbmVkQ2FsbC9teV9tb2RlbF80L2dydV80L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/merge/_58", "op": "Merge", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/enter/_47", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/next_iteration/_94"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/enter/_46", "op": "Enter", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/TensorArrayV2_1"], "attr": {"T": {"type": "DT_VARIANT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvb25lX3N0ZXBfMy9TdGF0ZWZ1bFBhcnRpdGlvbmVkQ2FsbC9teV9tb2RlbF80L2dydV80L1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/merge/_59", "op": "Merge", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/enter/_48", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/next_iteration/_95"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/merge/_57", "op": "Merge", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/enter/_46", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/next_iteration/_93"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/cond/_41/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/merge/_56", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/merge/_59", "^StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/merge/_54"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/LoopCond/_65", "op": "LoopCond", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/cond/_41/while/Less"]}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_72", "op": "Switch", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/merge/_60", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/LoopCond/_65"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/input/_34_switch/_73", "op": "Switch", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/merge/_61", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/LoopCond/_65"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/unstack_switch/_74", "op": "Switch", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/merge/_62", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/LoopCond/_65"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/input/_35_switch/_75", "op": "Switch", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/merge/_63", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/LoopCond/_65"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/unstack_switch/_76", "op": "Switch", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/merge/_64", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/LoopCond/_65"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/time_switch/_68", "op": "Switch", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/merge/_56", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/LoopCond/_65"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/loop_counter_switch/_66", "op": "Switch", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/merge/_54", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/LoopCond/_65"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/TensorArrayV2_1_switch/_69", "op": "Switch", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/merge/_57", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/LoopCond/_65"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/strided_slice_switch/_71", "op": "Switch", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/merge/_59", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/LoopCond/_65"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/input/_33_switch/_70", "op": "Switch", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/merge/_58", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/LoopCond/_65"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/loop_body_control/_77", "op": "Identity", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/loop_counter_switch/_66:1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/exit/_81", "op": "Exit", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/TensorArrayV2_1_switch/_69"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/exit/_82", "op": "Exit", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/input/_33_switch/_70"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/body/_42/while/sub/x", "op": "Const", "input": ["^StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/loop_body_control/_77"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/body/_42/while/split/split_dim", "op": "Const", "input": ["^StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/loop_body_control/_77"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/next_iteration/_96", "op": "NextIteration", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_72:1", "^StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/loop_body_control/_77"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/body/_42/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/loop_body_control/_77"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/next_iteration/_97", "op": "NextIteration", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/input/_34_switch/_73:1", "^StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/loop_body_control/_77"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/next_iteration/_98", "op": "NextIteration", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/unstack_switch/_74:1", "^StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/loop_body_control/_77"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/body/_42/while/split_1/split_dim", "op": "Const", "input": ["^StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/loop_body_control/_77"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/next_iteration/_99", "op": "NextIteration", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/input/_35_switch/_75:1", "^StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/loop_body_control/_77"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/next_iteration/_100", "op": "NextIteration", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/unstack_switch/_76:1", "^StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/loop_body_control/_77"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/body/_42/input/_117", "op": "Identity", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/time_switch/_68:1", "^StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/loop_body_control/_77"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/body/_42/while/add_4/y", "op": "Const", "input": ["^StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/loop_body_control/_77"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/body/_42/while/add_5/y", "op": "Const", "input": ["^StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/loop_body_control/_77"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/next_iteration/_95", "op": "NextIteration", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/strided_slice_switch/_71:1", "^StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/loop_body_control/_77"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/body/_42/while/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/input/_33_switch/_70:1", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/input/_35_switch/_75:1", "^StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/loop_body_control/_77"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/exit/_81", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "-1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/body/_42/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_72:1", "Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/body/_42/input/_117", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/body/_42/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/body/_42/while/add_4", "op": "AddV2", "input": ["Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/body/_42/input/_117", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/body/_42/while/add_4/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/body/_42/while/add_5", "op": "AddV2", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/loop_counter_switch/_66:1", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/body/_42/while/add_5/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/body/_42/while/BiasAdd_1", "op": "BiasAdd", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/body/_42/while/MatMul_1", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/unstack_switch/_76:1"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/body/_42/while/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/body/_42/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/Func/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/input/_34_switch/_73:1", "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/unstack_switch/_74:1"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/next_iteration/_92", "op": "NextIteration", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/body/_42/while/add_4", "^StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/loop_body_control/_77"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/next_iteration/_90", "op": "NextIteration", "input": ["StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/body/_42/while/add_5", "^StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/loop_body_control/_77"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/one_step_3/StatefulPartitionedCall/my_model_4/gru_4/PartitionedCall/while/body/_42/while/split_1", "op": "Split", "input": 